[
    {
        "id": "0",
        "title": "Title for Chunk 0",
        "content": " \n  \nMcGee – MANA 4322.015 - Fall 2023 -- 1 \n \n \nMANA 4322 Section 015: Strategic Management \nFall 2023 \nInstructor Information \nInstructor:  Jeffrey E. McGee \nOffice: COBA 229 \nOffice Hours: By Appointment \nOffice Telephone Number: (817) 272-3166 \nFaculty Profile: http://www.uta.edu/profiles/jmcgee  \nE-mail:  jmcgee@uta.edu \nCourse Information \nSection Information: MANA 4322-015  \nTime and Place of Class Meetings: TuTH 11:00 a.m. - 12:30 p.m. COBA154.  \nText: Essentials of Strategic Management: The Quest for Competitive Advantage, 7th Edition. \nISBN10: 1264124333 | ISBN13: 9781264124336 ISBN10# 1260261549 and ISBN13# 97812660261547. (5th through \n7th Editions will also be acceptable). Capstone® Business Simulation (online registration and fee). Download the \nTeam Membership Guide from the website after registration. Capstone Business Simulation Online registration at \nCapsim.com – ID# C145441. \nDescription of Course Content  \nStrategic Management, as a field of study, considers the overall direction of an enterprise. This course focuses on \ncorporate and business unit-level strategy formulation and implementation. It",
        "category": "Category"
    },
    {
        "id": "1",
        "title": "Title for Chunk 1",
        "content": " requires applying the knowledge and \ntechniques learned in the earlier courses in an integrated fashion. The topics to be covered include the relationship of \norganizations to their environments, organizational mission and objectives, systematic analysis of the external and \ninternal environments of the firm using various theoretical frameworks, corporate-level and business-level strategies, \nthe role of organizational structures and systems in the context of strategy formulation and implementation and the \nmechanisms for monitoring and evaluating the effectiveness of strategic decisions and their implementation.  \nThis course encourages an integrated, multifunctional, \"general management\" perspective of the organization and its \nenvironment to develop skills necessary and appropriate to corporate-level and divisional-level policy analysis, \nformulation, and implementation.  \nThis is the capstone course for business majors. Prerequisite: ACCT 2301 and ACCT 2302, BUSA/STAT/BSTAT 3321, \nECON 2305 and ECON 2306, FINA 3313, MANA 3318, and MARK 3321. One of the following junior-level courses may be \ntaken concurrently: BSTAT 3321, FINA 3313, MANA 3318, or MARK 3321 \nStudent Learning Objectives  \n1. \nConstruct a managerial perspective recognizing long-term and short-term organizational goals and multiple \nstakeholders.  \n2. \nOrganize the diverse functional disciplines learned in earlier courses – finance, marketing, human resources, \nand decision systems",
        "category": "Category"
    },
    {
        "id": "2",
        "title": "Title for Chunk 2",
        "content": " – into one integrative perspective.  \n3. \nExplain the three major strategic management elements: strategy analysis, formulation, and implementation.  \n4. \nExplain the influence of global competition on firm strategy and performance.  \n \n  \nMcGee – MANA 4322.015 - Fall 2023 -- 2 \n \n5. \nExamine the business's internal and external environments using tools like Five Forces Analysis, Value Chain \nAnalysis, and SWOT Analysis.  \n6. \nDevelop the capacity to communicate the results of a case analysis based on specific, actionable \nrecommendations.  \n7. \nOutline the ethical and social dimensions of corporate actions.  \n8. \nIdentify a firm’s capabilities to develop and sustain a competitive advantage over its rivals. \nStudent Learning Outcomes  \nAfter completing the course, the student will be able to:  \n1. \nanalyze a particular business situation, \n2. \nidentify the significant problems, and \n3. \npropose and justify explicit realistic, effective, and efficient solutions.  \nAchieving the Objectives \nYou will be required to complete five activities to achieve the identified objectives: \n1. \nContribute to virtual case discussions. Please see Case Discussion Rubric and instructions on Canvas for \nadditional details. Class Participation: CONTRIBUTE TO IN-CLASS DISCUSSIONS of chapters, videos, cases, and \nlecture material by exhibiting (a) an understanding of the information presented and (b) skills in the \n",
        "category": "Category"
    },
    {
        "id": "3",
        "title": "Title for Chunk 3",
        "content": "prerequisite course areas required for registration. \nStudents are expected to participate in class discussions actively. Students are expected to read all the cases \nand participate in case discussions, even if the case is not the one for which they are writing a report. \nParticipation on these dates is critical to a good class participation grade.  Class participation will be \nevaluated using the following criteria. \n100% - Truly outstanding participation.  Contributed to each session’s discussion with well-thought-out ideas \nand comments. \n95% - Excellent participation.  Contributed regularly to discussions with reasonably well-developed ideas and \ncomments. \n85% - Good participation.  Contributed to most discussions with relevant comments. \n75% - Average Participation. Attended class sessions and listened actively to discussions. Actual contributions \nto the discussion were infrequent. \n70% - Minimum level of Participation. Attended ALL class sessions but did not contribute to class discussions \nat all. \nSimply coming to class will not earn a satisfactory participation grade! I may call names during class, and you should \nrespond to any questions I may ask. \n2. \nComplete Ten Chapter Quizzes.  You will be required to complete 10 brief quizzes containing ten multiple-\nchoice questions about the assigned text reading. You will only be able to take each quiz during the specified \ntime.  \n3. \nComplete Case-Based Exam. \n4. \nStudents will work in groups to perform Capstone®, a",
        "category": "Category"
    },
    {
        "id": "4",
        "title": "Title for Chunk 4",
        "content": " simulation exercise.  Each group will have responsibility \nfor one company.  Students will craft corporate- business-, and functional-level strategies.  The company \nperformance grade will be assigned on a group basis and will be based on your company’s stock price. \n5. \nAnnual Report.  At the end of the simulation, each group will be required to submit an “Annual Report” \ndescribing the company’s performance during the 8 years (rounds of operation) and the plans for the future. \n \n  \nMcGee – MANA 4322.015 - Fall 2023 -- 3 \n \nPeer Evaluations: Students should submit a peer evaluation for the group case analysis report. Peer \nevaluations are mandatory. Peer evaluations will adjust the group case analysis report grade. Not turning in \nthe peer evaluation by the deadline will result in a self-evaluation of zero. More information on peer \nevaluations is found below under “Grading Information.” \n6. \nCOB Proficiency Exam: The Association to Advance Collegiate Schools of Business (AACSB) and the Southern \nAssociation of Colleges and Schools (SACS) require in their accreditation standards that academic units assess \nstudent learning or measure the acquisition of knowledge and skills in a particular field of study.  Assurance of \nlearning and program assessment is done in the context of a set of learning goals. Students in MANA 4322 will \ntake the COB Business Exam. The major field test in",
        "category": "Category"
    },
    {
        "id": "5",
        "title": "Title for Chunk 5",
        "content": " business contains objective (multiple-choice) questions.  \nQuestions vary in difficulty over areas known as the 'common body of knowledge as specified by AACSB. This \ncommon core includes topics from accounting, economics, management, information systems, operation \nmanagement, real estate and finance, and marketing. \nThe purpose of this exam is to:  \na. \nMeasure students' academic achievement in the multidisciplinary subject matter representative of \nundergraduate business education.  \nb. \nProvide information to students regarding their level of achievement.  \nc. \nProvide information to faculties regarding the achievement of their students; information that the \ninstitution can use to assess their performance relative to their specific mission and objectives.  \nd. \nProvide information to facilitate the development of appropriate goals and educational programs and \nenhance undergraduate business education's accountability.  \nThe COB Proficiency Exam covers the entire BBA degree and is administered as part of MANA 4322. There is \nno preparation or study guide for the COB Exam. The COB Exam is proctored and requires students to bring \ntheir own laptop equipped with RESPONDUS LOCKDOWN BROWSER. Note: For Fall 2023, we will apply the \nsame COB Exam score adjustment used for Spring 2023 class sections, which was twenty (20) points. Students \nwill see then added 20 points as a separate grade award labeled “COB EXAM ADJUSTMENT.”  \nGrading \nYour performance in the following",
        "category": "Category"
    },
    {
        "id": "6",
        "title": "Title for Chunk 6",
        "content": " activities will determine your final grade.  Their respective weights are as follows: \n1. Participation \n10% \n2. Ten Chapter Quizzes \n20% \n3. Cased-Based Examination \n25% \n4. Capstone® – A Business Simulation* \n \n \nCompany Performance \n25% \n \nShareholder’s Meeting and Annual Report \n10% \nCOB Proficiency Exam \n10% \n \n \n \nTOTAL  \n \n \n \n \n \n \n \n100% \nIMPORTANT: Group and individual case analysis reports will be run through our plagiarism tool on Canvas: Unicheck. \nIf your analysis is found to be a copy of someone else’s work, you will earn a ZERO in that case and will be sent to the \nOffice of Student Conduct.  \nAll assignments are due at specific times and dates. Turning assignments late may constitute a drop in grade, or the \ninstructor may decide not to take the assignment. The final grade will be based on the requirements explained above.  \nThe letter grade that you obtain in the course will be based on the numeric grade you obtain as follows: \n \n \n \n \n  \nMcGee – MANA 4322.015 - Fall 2023 -- 4 \n \nModule \nDate \nTopic/Assignment \nModule \n#1 \n8/22 \nCourse Introduction \n8/24 \nIntroduction to Capstone® \n8/29 \nCapstone® – Practice Decision #1 \n8/31 \nCapstone® – Practice Decision #2 \nModule \n#2",
        "category": "Category"
    },
    {
        "id": "7",
        "title": "Title for Chunk 7",
        "content": " \n9/5 \nCapstone® – Practice Decision #3 \n9/7 \nChapter 1 – Strategy, Business Models, and Competitive Advantage \nQuiz 1 \n9/12 \nChapter 2 – Strategy Formulation, Execution, and Governance \nQuiz 2  \n9/14 \nCapstone® – Decision #1 \n9/19 \nChapter 3 – Evaluating a Company’s External Environment \nQuiz 3  \n9/21 \nCapstone® – Decision #2 \nModule \n#3 \n9/26 \nCase – Panera Bread Company in 2014: Can a Slowdown in the Company’s Growth be Avoided? \n9/28 \nCapstone® – Decision #3 \n10/3 \nChapter 4 – Evaluating a Company’s Resources, Capabilities, and Competitiveness \nQuiz 4 \n10/5 \nCapstone® – Decision #4 \n10/10 \nChapter 5 – Five Generic Competitive Strategies (Virtual Session) \nQuiz 5 \nCase – “Whole Foods Market in 2014: Vision, Core Values, and Strategy” \n10/12 \nCapstone® – Decision #5 \n10/17 \nEmployer Start-Up Panel – Room 152 \n10/19 \nCapstone® – Decision #6 \nModule \n#4 \n10/24 \nChapter 6 – Strengthening a Company’s Competitive Position: Strategic Moves, Timing, and \nScope of Operations \nQuiz 6",
        "category": "Category"
    },
    {
        "id": "8",
        "title": "Title for Chunk 8",
        "content": " \n10/26 \nCapstone® – Decision #7 \n10/31 \nChapter 7 – Strategies for Competing in International Markets \nQuiz 7 \n11/2 \nCapstone® – Decision #8 \nModule \n#5 \n11/7 \nCase – Deere & Company in 2015: Striving for Growth in a Weakening Global Agricultural \nSector \n11/9 \nChapter 8 – Corporate Strategy: Diversification and the Multibusiness Company \nQuiz 8 \n11/14 \nChapter 9 – Ethics, Corporate Social Responsibility, Environmental Sustainability, and Strategy \nQuiz 9 \n11/16 \nCase – PepsiCo’s Diversification Strategy in 2014 \nModule \n#6 \n11/21 \nCapstone Debrief (Virtual Session) \n11/23 \nThanksgiving Holiday \n11/28 \nChapter 10 – Superior Strategy Execution—Another Path to Competitive Advantage \nQuiz 10 \n11/30 \nShareholder Report (Simulation Presentation) \nMavPitch – 4:30 until 7:30 (Extra Credit Opportunity) \nModule \n#7 \n12/5 \nCapstone® Report \nCase-Based Exam Due \n12/7 \nCOB Proficiency Exam (11:00-1:30) \n \n \n \n \n \n  \nMcGee – MANA 4322.015 - Fall 2023 -- 5 \n \nAbout the Instructor \nDr. Jeffrey E. McGee is a Full Professor",
        "category": "Category"
    },
    {
        "id": "9",
        "title": "Title for Chunk 9",
        "content": " of Management and Maverick Entrepreneurship \nFellow at the University of Texas at Arlington. He holds a Ph.D. in management from the \nUniversity of Georgia and teaches strategic management and entrepreneurship courses \nfor the UT Arlington MBA program. Dr. McGee also regularly teaches similar courses for \nthe Executive MBA program in Taiwan. \nDr. McGee’s primary research interests focus on strategic management and \nentrepreneurship. His work appears in over 45 journals, including Management Science, \nEntrepreneurship: Theory & Practice, Strategic Organization, Journal of Business Venturing, Strategic Management \nJournal, and Journal of Applied Business Research. He has presented over 75 papers at some of the most prestigious \nacademic conferences, including the Academy of Management. Dr. McGee has also been cited in the New York Times, \nFort Worth Star-Telegram, Dallas Morning News, and other news publications. \nDr. McGee served as the Chair of the Department of Management at UT Arlington from 2001 through 2010. He \nregularly consults with entrepreneurial ventures in the Dallas-Fort Worth Metroplex on various management-related \nissues. \nInstitution Information \nUTA students are encouraged to review the institutional policies and informational sections below and contact the \nspecific office with any questions. To view this institutional information, please visit the Institutional Information page \n(http://www.uta.edu/provost/administrative-forms/course-syllabus/index.php ), which includes the following policies, \n",
        "category": "Category"
    },
    {
        "id": "10",
        "title": "Title for Chunk 10",
        "content": "among others: \n• \nDrop Policy \n• \nDisability Accommodations \n• \nTitle IX Policy \n• \nAcademic Integrity \n• \nStudent Feedback Survey \n• \nFinal Exam Schedule \nAdditional Information \nFace Covering Policy \nWhile the use of face coverings on campus is no longer mandatory, all students and instructional staff are strongly \nencouraged to wear face coverings while they are on campus. This is particularly true inside buildings and within \nclassrooms and labs where social distancing is impossible due to limited space. If a student needs accommodations to \nensure social distancing in the classroom due to being at high risk, they are encouraged to work directly with the \nStudent Access and Resource Center to assist in these accommodations. If students need masks, they may obtain them \nat the Central Library, the E.H. Hereford University Center’s front desk, or in their department. \nAttendance \nAt The University of Texas at Arlington, taking attendance is not required, but attendance is a critical indicator of \nstudent success. However, while UT Arlington does not require instructors to take attendance in their courses, the U.S. \nDepartment of Education requires that the University have a mechanism in place to mark when Federal Student Aid \nrecipients “begin attendance in a course.” UT Arlington instructors will report when students begin attendance in a \ncourse as part of the final grading process. Specifically, when assigning a student a grade of F, the faculty report the last \ndate a student attended their",
        "category": "Category"
    },
    {
        "id": "11",
        "title": "Title for Chunk 11",
        "content": " class based on evidence such as a test, participation in a class project or presentation, or \nan engagement online via Canvas. This data is reported to the Department of Education for federal financial aid \nrecipients. \nAcademic Success Center \nThe Academic Success Center (ASC) includes a variety of resources and services to help you maximize your learning and \nsucceed as a student at the University of Texas at Arlington.  ASC services include supplemental instruction, peer-led \n \n  \nMcGee – MANA 4322.015 - Fall 2023 -- 6 \n \nteam learning, tutoring, mentoring, and TRIO SSS.  Academic Success Center services are provided at no additional cost \nto UTA students. For additional information, visit:  Academic Success Center.  To request disability accommodations for \ntutoring, please complete this form. \nUTA College of Business Exam \nThe UTA College of Business Exam covers material drawn from the core business classes for the UTA Bachelor of \nBusiness Administration. The business core includes accounting, economics, organizational behavior, quantitative \nbusiness analysis, information systems, operations management, finance, marketing, business law, and strategic \nmanagement. \nMANA 4322 COB Exam Information & Policies \n \nExam Details \nPurpose: Assess your understanding of core subjects in UTA undergraduate business education, \nmarking a key step of achievement in your academic career. \nTopic: Material from the core business classes, including accounting, economics, information \nsystems",
        "category": "Category"
    },
    {
        "id": "12",
        "title": "Title for Chunk 12",
        "content": ", business statistics, finance, marketing, business law, and management. A list of specific \ntopics will be provided. \nWhen & Where: [Insert scheduled final exam date/time for your class and building/room number] \n(2-hour time limit). \nFormat: 72 questions shown one at a time & and locked after answering. \nThe calculator will be Provided through Respondus Browser: Do not bring any personal calculators \nor other prohibited materials. \nWeight: 10% of final grade. \nAdditional details will be provided in Canvas throughout the semester. \nWhat to Bring \nFully charged Laptop/iPad with Respondus Lockdown Browser:  \nNeed a laptop? You can borrow one from the UTA Library. \nDownload Respondus here: A non-graded Respondus quiz will be provided in Canvas so \nyou can check that it is working before the exam. \nStudent ID: Attendance will be taken. \nCanvas username & password: Needed to connect to Internet & Exam. \nConduct & \nIntegrity \nProhibited Items: calculators, smartwatches, tablets, cellphones, misc. electronics, notes, brimmed \nhats, bags, and drinks are strictly prohibited. \nFollow all In-Class Rules: When entering, put all belongings on the side of the room. No talking. Any \nstudent caught cheating / with prohibited items will earn a 0. \nPunctuality: Plan to arrive early. If you arrive late, your",
        "category": "Category"
    },
    {
        "id": "13",
        "title": "Title for Chunk 13",
        "content": " available exam time may be reduced. You \nmust submit the exam once the scheduled class time ends, even if you still have some of the 2-hour \ntest time left. \nFeedback: To preserve the integrity of this exam, students will NOT be able to review exam \nquestions/answers under any circumstances.  \n \n  \nMcGee – MANA 4322.015 - Fall 2023 -- 7 \n \nSpecial \nConsiderations \nExtra Credit: An optional survey, if completed by the last day of class, will earn you extra credit \nequivalent to 5 points on your COB exam score (which will be out of 100 points). This extra credit \nwill be applied solely to the COB exam and not to your overall course grade. Additional details will \nbe provided later in the semester. \nSAR Accommodations: Coordinate with your professor and the SAR testing center at the beginning \nof the semester if you have any accommodations. \nEmergency Situations: If an emergency prevents you from attending, contact your professor as \nsoon as possible with documentation for an excused absence and accommodation. \nUnexcused Absences: Tests for students who miss the scheduled test time without excused \nabsences may be rescheduled and given up to 50% credit. \n \n \n \n",
        "category": "Category"
    }
]